
//空运出口_申报方式
var sbfs_kyck_js_data =
[{ "CODE": "008", "NAME": "出口提前(008)" }, { "CODE": "011", "NAME": "口岸清关(011)" }, { "CODE": "010", "NAME": "通关一体化(010)" }]
;
//海运进口_申报方式
var sbfs_hyjk_js_data =
[{ "CODE": "002", "NAME": "进口提前(002)" }, { "CODE": "003", "NAME": "直通进口(003)" }, { "CODE": "005", "NAME": "属报口放(005)" }, { "CODE": "006", "NAME": "属报属放(006)" }, { "CODE": "011", "NAME": "口岸清关(011)" }, { "CODE": "004", "NAME": "直转进口(004)" }, { "CODE": "010", "NAME": "通关一体化(010)" }]
;
//海运出口_申报方式
var sbfs_hyck_js_data =
[{ "CODE": "008", "NAME": "出口提前(008)" }, { "CODE": "006", "NAME": "属报属放(006)" }, { "CODE": "011", "NAME": "口岸清关(011)" }, { "CODE": "010", "NAME": "通关一体化(010)" }]
;
//特殊区域_申报方式
var sbfs_tsqy_js_data =
[{ "CODE": "002", "NAME": "进口提前(002)" }, { "CODE": "008", "NAME": "出口提前(008)" }, { "CODE": "001", "NAME": "一般进口(001)" }, { "CODE": "007", "NAME": "一般出口(007)" }]
;
//陆运进口_申报方式
var sbfs_lyjk_js_data = [{ "CODE": "004", "NAME": "直转进口(004)" }];
//陆运出口_申报方式
var sbfs_lyck_js_data =
[{ "CODE": "009", "NAME": "二次转关(009)" }]
;
//委托类型
var wtlx_js_data =
[{ "CODE": "01", "NAME": "报关单(01)" }, { "CODE": "02", "NAME": "报检单(02)" }, { "CODE": "03", "NAME": "报关/检单(03)" }]
;
//报关方式
var bgfs_js_data =
[{ "CODE": "0", "NAME": "有纸报关(0)" }, { "CODE": "W", "NAME": "无纸报关(W)" }, { "CODE": "L", "NAME": "有纸带清单报关(L)" }, { "CODE": "D", "NAME": "无纸带清单报关(D)" }, { "CODE": "M", "NAME": "通关无纸化(M)" }]
;
//包装种类
var bzzl_js_data =
[{ "CODE": "1", "NAME": "木箱(1)" }, { "CODE": "2", "NAME": "纸箱(2)" }, { "CODE": "3", "NAME": "桶装(3)" }, { "CODE": "4", "NAME": "散装(4)" }, { "CODE": "5", "NAME": "托盘(5)" }, { "CODE": "6", "NAME": "包(6)" }, { "CODE": "7", "NAME": "其它(7)" }]
;
//贸易方式
var myfs_js_data =
[{ "ID": 343.0, "CODE": "0139", "NAME": "旅游购物商品(0139)" }, { "ID": 344.0, "CODE": "0200", "NAME": "料件销毁(0200)" }, { "ID": 345.0, "CODE": "0214", "NAME": "来料加工(0214)" }, { "ID": 346.0, "CODE": "0245", "NAME": "来料料件内销(0245)" }, { "ID": 347.0, "CODE": "0255", "NAME": "来料深加工(0255)" }, { "ID": 348.0, "CODE": "0258", "NAME": "来料余料结转(0258)" }, { "ID": 349.0, "CODE": "0265", "NAME": "来料料件复出(0265)" }, { "ID": 350.0, "CODE": "0300", "NAME": "来料料件退换(0300)" }, { "ID": 351.0, "CODE": "0314", "NAME": "加工专用油(0314)" }, { "ID": 352.0, "CODE": "0320", "NAME": "不作价设备(0320)" }, { "ID": 353.0, "CODE": "0345", "NAME": "来料成品减免(0345)" }, { "ID": 354.0, "CODE": "0400", "NAME": "边角料销毁(0400)" }, { "ID": 355.0, "CODE": "0420", "NAME": "加工贸易设备(0420)" }, { "ID": 356.0, "CODE": "0444", "NAME": "保区进料成品(0444)" }, { "ID": 357.0, "CODE": "0445", "NAME": "保区来料成品(0445)" }, { "ID": 358.0, "CODE": "0446", "NAME": "加工设备内销(0446)" }, { "ID": 359.0, "CODE": "0456", "NAME": "加工设备结转(0456)" }, { "ID": 360.0, "CODE": "0466", "NAME": "加工设备退运(0466)" }, { "ID": 361.0, "CODE": "0500", "NAME": "减免设备结转(0500)" }, { "ID": 362.0, "CODE": "0513", "NAME": "补偿贸易(0513)" }, { "ID": 363.0, "CODE": "0544", "NAME": "保区进料料件(0544)" }, { "ID": 364.0, "CODE": "0545", "NAME": "保区来料料件(0545)" }, { "ID": 365.0, "CODE": "0615", "NAME": "进料对口(0615)" }, { "ID": 366.0, "CODE": "0642", "NAME": "进料以产顶进(0642)" }, { "ID": 367.0, "CODE": "0644", "NAME": "进料料件内销(0644)" }, { "ID": 368.0, "CODE": "0654", "NAME": "进料深加工(0654)" }, { "ID": 369.0, "CODE": "0657", "NAME": "进料余料结转(0657)" }, { "ID": 370.0, "CODE": "0664", "NAME": "进料料件复出(0664)" }, { "ID": 371.0, "CODE": "0700", "NAME": "进料料件退换(0700)" }, { "ID": 372.0, "CODE": "0715", "NAME": "进料非对口(0715)" }, { "ID": 373.0, "CODE": "0744", "NAME": "进料成品减免(0744)" }, { "ID": 374.0, "CODE": "0815", "NAME": "低值辅料(0815)" }, { "ID": 375.0, "CODE": "0844", "NAME": "进料边角料内销(0844)" }, { "ID": 376.0, "CODE": "0845", "NAME": "来料边角料内销(0845)" }, { "ID": 377.0, "CODE": "0864", "NAME": "进料边角料复出(0864)" }, { "ID": 378.0, "CODE": "0865", "NAME": "来料边角料复出(0865)" }, { "ID": 379.0, "CODE": "1139", "NAME": "国轮油物料(1139)" }, { "ID": 380.0, "CODE": "1200", "NAME": "保税间货物(1200)" }, { "ID": 381.0, "CODE": "1215", "NAME": "保税工厂(1215)" }, { "ID": 382.0, "CODE": "1233", "NAME": "保税仓库货物(1233)" }, { "ID": 383.0, "CODE": "1234", "NAME": "保税区仓储转口(1234)" }, { "ID": 384.0, "CODE": "1300", "NAME": "修理物品(1300)" }, { "ID": 385.0, "CODE": "1427", "NAME": "出料加工(1427)" }, { "ID": 386.0, "CODE": "1500", "NAME": "租赁不满1年(1500)" }, { "ID": 387.0, "CODE": "1523", "NAME": "租赁贸易(1523)" }, { "ID": 388.0, "CODE": "1616", "NAME": "寄售代销(1616)" }, { "ID": 389.0, "CODE": "1741", "NAME": "免税品(1741)" }, { "ID": 390.0, "CODE": "1831", "NAME": "外汇商品(1831)" }, { "ID": 391.0, "CODE": "2025", "NAME": "合资合作设备(2025)" }, { "ID": 392.0, "CODE": "2225", "NAME": "外资设备物品(2225)" }, { "ID": 393.0, "CODE": "2439", "NAME": "常驻机构公用(2439)" }, { "ID": 394.0, "CODE": "2600", "NAME": "暂时进出货物(2600)" }, { "ID": 395.0, "CODE": "2700", "NAME": "展览品(2700)" }, { "ID": 396.0, "CODE": "2939", "NAME": "陈列样品(2939)" }, { "ID": 397.0, "CODE": "3010", "NAME": "货样广告品Ａ(3010)" }, { "ID": 398.0, "CODE": "3039", "NAME": "货样广告品Ｂ(3039)" }, { "ID": 399.0, "CODE": "3100", "NAME": "无代价抵偿(3100)" }, { "ID": 400.0, "CODE": "3339", "NAME": "其他进出口免费(3339)" }, { "ID": 401.0, "CODE": "3410", "NAME": "承包工程进口(3410)" }, { "ID": 402.0, "CODE": "3422", "NAME": "对外承包出口(3422)" }, { "ID": 403.0, "CODE": "3511", "NAME": "援助物资(3511)" }, { "ID": 404.0, "CODE": "3611", "NAME": "无偿军援(3611)" }, { "ID": 405.0, "CODE": "3612", "NAME": "捐赠物资(3612)" }, { "ID": 406.0, "CODE": "3910", "NAME": "军事装备(3910)" }, { "ID": 407.0, "CODE": "4019", "NAME": "边境小额(4019)" }, { "ID": 408.0, "CODE": "4039", "NAME": "对台小额(4039)" }, { "ID": 409.0, "CODE": "4139", "NAME": "对台小额商品交易市场(4139)" }, { "ID": 410.0, "CODE": "4200", "NAME": "驻外机构运回(4200)" }, { "ID": 411.0, "CODE": "4239", "NAME": "驻外机构购进(4239)" }, { "ID": 412.0, "CODE": "4400", "NAME": "来料成品退换(4400)" }, { "ID": 413.0, "CODE": "4500", "NAME": "直接退运(4500)" }, { "ID": 414.0, "CODE": "4539", "NAME": "进口溢误卸(4539)" }, { "ID": 415.0, "CODE": "4561", "NAME": "退运货物(4561)" }, { "ID": 416.0, "CODE": "4600", "NAME": "进料成品退换(4600)" }, { "ID": 417.0, "CODE": "5000", "NAME": "料件进出区(5000)" }, { "ID": 418.0, "CODE": "5010", "NAME": "特殊区域研发货物(5010)" }, { "ID": 419.0, "CODE": "5014", "NAME": "区内来料加工(5014)" }, { "ID": 341.0, "CODE": "0110", "NAME": "一般贸易(0110)" }, { "ID": 342.0, "CODE": "0130", "NAME": "易货贸易(0130)" }, { "ID": 422.0, "CODE": "5034", "NAME": "区内物流货物(5034)" }, { "ID": 423.0, "CODE": "5100", "NAME": "成品进出区(5100)" }, { "ID": 424.0, "CODE": "5200", "NAME": "区内边角调出(5200)" }, { "ID": 425.0, "CODE": "5300", "NAME": "设备进出区(5300)" }, { "ID": 426.0, "CODE": "5335", "NAME": "境外设备进区(5335)" }, { "ID": 427.0, "CODE": "5361", "NAME": "区内设备退运(5361)" }, { "ID": 428.0, "CODE": "6033", "NAME": "物流中心进出境货物(6033)" }, { "ID": 429.0, "CODE": "9600", "NAME": "内贸货物跨境运输(9600)" }, { "ID": 430.0, "CODE": "9639", "NAME": "海关处理货物(9639)" }, { "ID": 431.0, "CODE": "9700", "NAME": "后续补税(9700)" }, { "ID": 432.0, "CODE": "9739", "NAME": "其他贸易(9739)" }, { "ID": 433.0, "CODE": "9800", "NAME": "租赁征税(9800)" }, { "ID": 434.0, "CODE": "9839", "NAME": "留赠转卖物品(9839)" }, { "ID": 435.0, "CODE": "9900", "NAME": "其他(9900)" }, { "ID": 443.0, "CODE": "1371", "NAME": "保税维修(1371)" }, { "ID": 420.0, "CODE": "5015", "NAME": "区内进料加工货物(5015)" }, { "ID": 421.0, "CODE": "5033", "NAME": "区内仓储货物(5033)" }]
;

//货物类型
var hwlx_js_data =
[{ "CODE": "1", "NAME": "整箱(1)" }, { "CODE": "2", "NAME": "散货(2)" }];

//查询区域 查询条件1 /Common/loadcondition1
var search_js_condition1_data = [{ "NAME": "经营单位", "CODE": "BUSIUNITCODE" }, { "NAME": "申报关区", "CODE": "CUSTOMDISTRICTCODE" }, { "NAME": "进口口岸", "CODE": "PORTCODE" }, { "NAME": "申报方式", "CODE": "REPWAYID" }];
//查询区域 查询条件1 /Common/loadcondition2
var search_js_condition2_data = [{ "NAME": "订单编号", "CODE": "CODE" }, { "NAME": "客户编号", "CODE": "CUSNO" }, { "NAME": "分单号", "CODE": "DIVIDENO" }, { "NAME": "合同发票号", "CODE": "CONTRACTNO" }, { "NAME": "载货清单号", "CODE": "MANIFEST" }];
//查询区域 查询条件1 /Common/loadcondition3
var search_js_condition3_data = [{ "NAME": "订单状态", "CODE": "ddzt" }, { "NAME": "报关状态", "CODE": "bgzt" },
    { "NAME": "报检状态", "CODE": "bjzt" }, { "NAME": "预警状态", "CODE": "yjzt" }];
var search_js_condition3_orderstatus_data = [{ "CODE": "草稿", "NAME": "草稿" }, { "CODE": "订单待委托", "NAME": "订单待委托" },
    { "CODE": "订单待受理", "NAME": "订单待受理" }, { "CODE": "订单受理中", "NAME": "订单受理中" },
    { "CODE": "订单待交付", "NAME": "订单待交付" }, { "CODE": "订单已交付", "NAME": "订单已交付" },
    { CODE: '订单已作废', NAME: '订单已作废' }];
//查询区域 查询条件1 /Common/loadcondition3_1
var search_js_condition3_bgbjstatus_data = [{ "CODE": "50", "NAME": "制单中" }, { "CODE": "55", "NAME": "制单完成" }, { "CODE": "60", "NAME": "待审核" }, { "CODE": "65", "NAME": "审核已受理" }, { "CODE": "70", "NAME": "审核中（部分）" }, { "CODE": "71", "NAME": "审核中" }, { "CODE": "74", "NAME": "审核完成（部分）" }, { "CODE": "75", "NAME": "审核完成" }, { "CODE": "78", "NAME": "待预录" }, { "CODE": "80", "NAME": "预录已受理" }, { "CODE": "85", "NAME": "预录中(部分)" }, { "CODE": "86", "NAME": "预录中" }, { "CODE": "89", "NAME": "预录完成（部分）" }, { "CODE": "90", "NAME": "预录完成" }, { "CODE": "92", "NAME": "预录校验中" }, { "CODE": "93", "NAME": "预录校验完成（部分）" }, { "CODE": "95", "NAME": "预录校验完成" }, { "CODE": "100", "NAME": "申报中（部分）" }, { "CODE": "101", "NAME": "申报中" }, { "CODE": "102", "NAME": "申报退单" }, { "CODE": "103", "NAME": "提前申报完成" }, { "CODE": "104", "NAME": "申报完成（部分）" }, { "CODE": "105", "NAME": "申报完成" }, { "CODE": "106", "NAME": "申报完结（部分）" }, { "CODE": "107", "NAME": "申报完结" }];
//查询区域 查询条件1 /Common/loadcondition3_1
var search_js_condition3_yjstatus_data = [];
//查询区域 查询条件1 /Common/loadcondition4
var search_js_condition4_data = [{ "NAME": "委托日期", "CODE": "SUBMITTIME" }, { "NAME": "订单开始时间", "CODE": "CSSTARTTIME" }];
//国内结转业务 进出口类型
var ietype_js_data = [{ CODE: '仅进口', NAME: '仅进口' }, { CODE: '仅出口', NAME: '仅出口' }, { CODE: '进/出口业务', NAME: '进/出口业务' }]
//订单状态
var orderstatus_js_data = [{ "CODE": 1, "NAME": "草稿" }, { "CODE": 10, "NAME": "文件已上传" }, { "CODE": 15, "NAME": "订单已委托" }, { "CODE": 20, "NAME": "订单已受理" }, { "CODE": 25, "NAME": "订单预审中" }, { "CODE": 30, "NAME": "文件处理中" }, { "CODE": 35, "NAME": "文件处理完成" }, { "CODE": 40, "NAME": "订单预审完成" }, { "CODE": 45, "NAME": "订单处理中" }, { "CODE": 50, "NAME": "制单中" }, { "CODE": 55, "NAME": "制单完成" }, { "CODE": 60, "NAME": "待审核" }, { "CODE": 65, "NAME": "审核已受理" }, { "CODE": 70, "NAME": "审核中(部分)" }, { "CODE": 71, "NAME": "审核中" }, { "CODE": 74, "NAME": "审核完成(部分)" }, { "CODE": 75, "NAME": "审核完成" }, { "CODE": 78, "NAME": "待预录" }, { "CODE": 80, "NAME": "预录已受理" }, { "CODE": 85, "NAME": "预录中(部分)" }, { "CODE": 86, "NAME": "预录中" }, { "CODE": 89, "NAME": "预录完成(部分)" }, { "CODE": 90, "NAME": "预录完成" }, { "CODE": 92, "NAME": "预录校验中" }, { "CODE": 93, "NAME": "预录校验完成(部分)" }, { "CODE": 95, "NAME": "预录校验完成" }, { "CODE": 100, "NAME": "申报中(部分)" }, { "CODE": 101, "NAME": "申报中" }, { "CODE": 102, "NAME": "申报退单" }, { "CODE": 103, "NAME": "提前申报完成" }, { "CODE": 104, "NAME": "申报完成(部分)" }, { "CODE": 105, "NAME": "申报完成" }, { "CODE": 106, "NAME": "申报完结(部分)" }, { "CODE": 107, "NAME": "申报完结" }, { "CODE": 110, "NAME": "订单已交付" }];
//空进订单》报关单管理 查询区域 查询条件4 /Common/condition4
var declarationsearch_js_condition4_data = [{ "NAME": "订单委托日期", "CODE": "SUBMITTIME" }, { "NAME": "申报时间", "CODE": "REPTIME" }];
var orders_tatus = { '1': "草稿", '10': "文件已上传", '15': "订单已委托", '20': "订单已受理", '25': "订单预审中", '30': "文件处理中", '35': "文件处理完成", '40': "订单预审完成", '45': "订单处理中", '50': "制单中", '55': "制单完成", '60': "待审核", '65': "审核已受理", '70': "审核中(部分)", '71': "审核中", '73': '自审完成', '74': "审核完成(部分)", '75': "审核完成", '78': "待预录", '80': "预录已受理", '85': "预录中(部分)", '86': "预录中", '89': "预录完成(部分)", '90': "预录完成", '92': "预录校验中", '93': "预录校验完成(部分)", '95': "预录校验完成", '100': "申报中(部分)", '101': "申报中", '102': "申报退单", '103': "提前申报完成", '104': "申报完成(部分)", '105': "申报完成", '106': "申报完结(部分)", '107': "申报完结", '110': "订单已交付" };
//大于等于20  小于40  报关状态叫【报关报检都叫预审中】   ==40  【报关报检状态都叫预审完成】  ==45  【报关报检都叫制单已受理】
var declare_status = { '-1': '制单暂存', '-2': '解除制单暂存', '-3': '审核暂存', '-4': '解除审核暂存', '100': '申报中', '103': '提前申报完成', '105': '申报完成', '110': '已完结', '25': '预审中', '40': '预审完成', '45': '制单已受理', '50': '制单中', '55': '制单完成', '60': '待审核', '65': '审核已受理', '70': '审核中', '71': '待自审', '72': '自审失败', '73': '自审通过', '75': '审核完成', '78': '待预录', '80': '预录已受理', '85': '预录中', '90': '预录完成', '93': '预录校验中', '95': '预录校验完成' };
//业务类型静态数据
var common_data_busitype = [
    { "CODE": "10", "NAME": "空运出口" }, { "CODE": "11", "NAME": "空运进口" },
    { "CODE": "20", "NAME": "海运出口" }, { "CODE": "21", "NAME": "海运进口" },
    { "CODE": "30", "NAME": "陆运出口" }, { "CODE": "31", "NAME": "陆运进口" },
    { "CODE": "40", "NAME": "国内出口" }, { "CODE": "41", "NAME": "国内进口" },
    { "CODE": "50", "NAME": "特殊区域出口" }, { "CODE": "51", "NAME": "特殊区域进口" }];  